# House price prediction - linear regression

In [27]:
import pandas as pd 

# relative path
df = pd.read_csv("../../data/house_prices.csv")
df.head()

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,2014-05-02 00:00:00,313000.0,3.0,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,2014-05-02 00:00:00,2384000.0,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,Seattle,WA 98119,USA
2,2014-05-02 00:00:00,342000.0,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,0,26206-26214 143rd Ave SE,Kent,WA 98042,USA
3,2014-05-02 00:00:00,420000.0,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,0,857 170th Pl NE,Bellevue,WA 98008,USA
4,2014-05-02 00:00:00,550000.0,4.0,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992,9105 170th Ave NE,Redmond,WA 98052,USA

In [28]:
df.columns

Index(['date', 'price', 'bedrooms', 'bathrooms', 'sqft_living', 'sqft_lot',
       'floors', 'waterfront', 'view', 'condition', 'sqft_above',
       'sqft_basement', 'yr_built', 'yr_renovated', 'street', 'city',
       'statezip', 'country'],
      dtype='object')

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 18 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           4600 non-null   object
 1   price          4600 non-null   float64
 2   bedrooms       4600 non-null   float64
 3   bathrooms      4600 non-null   float64
 4   sqft_living    4600 non-null   int64
 5   sqft_lot       4600 non-null   int64
 6   floors         4600 non-null   float64
 7   waterfront     4600 non-null   int64
 8   view           4600 non-null   int64
 9   condition      4600 non-null   int64
 10  sqft_above     4600 non-null   int64
 11  sqft_basement  4600 non-null   int64
 12  yr_built       4600 non-null   int64
 13  yr_renovated   4600 non-null   int64
 14  street         4600 non-null   object
 15  city           4600 non-null   object
 16  statezip       4600 non-null   object
 17  country        4600 non-null   object
dtypes: float64(4), int64(9), object(5)
memory usage: 647.0+ KB

In [30]:
df["street"].unique()

array(['18810 Densmore Ave N', '709 W Blaine St',
       '26206-26214 143rd Ave SE', ..., '759 Ilwaco Pl NE',
       '5148 S Creston St', '18717 SE 258th St'],
      shape=(4525,), dtype=object)

In [31]:
df["country"].value_counts()

country
USA    4600
Name: count, dtype: int64

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 18 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           4600 non-null   object
 1   price          4600 non-null   float64
 2   bedrooms       4600 non-null   float64
 3   bathrooms      4600 non-null   float64
 4   sqft_living    4600 non-null   int64
 5   sqft_lot       4600 non-null   int64
 6   floors         4600 non-null   float64
 7   waterfront     4600 non-null   int64
 8   view           4600 non-null   int64
 9   condition      4600 non-null   int64
 10  sqft_above     4600 non-null   int64
 11  sqft_basement  4600 non-null   int64
 12  yr_built       4600 non-null   int64
 13  yr_renovated   4600 non-null   int64
 14  street         4600 non-null   object
 15  city           4600 non-null   object
 16  statezip       4600 non-null   object
 17  country        4600 non-null   object
dtypes: float64(4), int64(9), object(5)
memory usage: 647.0+ KB

In [33]:
# ordinal or not?
# there exist an order or not?
df["view"].value_counts()

view
0    4140
2     205
3     116
4      70
1      69
Name: count, dtype: int64

In [34]:
# categorical feature that is one-hot encoded - 0 or 1
df["waterfront"].value_counts()

waterfront
0    4567
1      33
Name: count, dtype: int64

In [35]:
df["condition"].value_counts()

condition
3    2875
4    1252
5     435
2      32
1       6
Name: count, dtype: int64

In [36]:
import duckdb as db

query = db.query (
    """
    SELECT
        AVG(price) AS avg_price,
        condition
    FROM
        df
    GROUP BY
        2
    ORDER BY 
        avg_price DESC
    """
).df()

query

       avg_price  condition
0  637041.322258          5
1  550111.516394          3
2  533647.286072          4
3  324373.750000          2
4  306633.333333          1

## Clean dataset

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 18 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           4600 non-null   object
 1   price          4600 non-null   float64
 2   bedrooms       4600 non-null   float64
 3   bathrooms      4600 non-null   float64
 4   sqft_living    4600 non-null   int64
 5   sqft_lot       4600 non-null   int64
 6   floors         4600 non-null   float64
 7   waterfront     4600 non-null   int64
 8   view           4600 non-null   int64
 9   condition      4600 non-null   int64
 10  sqft_above     4600 non-null   int64
 11  sqft_basement  4600 non-null   int64
 12  yr_built       4600 non-null   int64
 13  yr_renovated   4600 non-null   int64
 14  street         4600 non-null   object
 15  city           4600 non-null   object
 16  statezip       4600 non-null   object
 17  country        4600 non-null   object
dtypes: float64(4), int64(9), object(5)
memory usage: 647.0+ KB

In [38]:
df_cleaned = df.drop(
    ["country", "statezip", "city", "street", "date"], axis="columns"
)  # view?

df_cleaned["yr_renovated"] = df_cleaned.apply(
    lambda row: row["yr_built"] if not row["yr_renovated"] else row["yr_renovated"], axis=1
)
df_cleaned.head()

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated
0,313000.0,3.0,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005.0
1,2384000.0,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,1921.0
2,342000.0,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,1966.0
3,420000.0,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,1963.0
4,550000.0,4.0,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992.0

can also throw away outliers ...

In [39]:
X, y = df_cleaned.drop("price", axis=1), df_cleaned["price"]

X.head()

,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated
0,3.0,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005.0
1,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,1921.0
2,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,1966.0
3,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,1963.0
4,4.0,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992.0

## Split dataset into train and testing

In [42]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(
    X, y, test_size=0.33, random_state=42
)

X_train.shape, X_test.shape

((3082, 12), (1518, 12))

## Scale dataset

In [44]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
scaler.fit(X_train)

scaled_X_train = scaler.transform(X_train)
scaled_X_test = scaler.transform(X_test)

scaled_X_train.min()

np.float64(-3.7457309137157586)

In [47]:
scaled_X_train.mean(), scaled_X_train.std()

(np.float64(9.975917032863725e-17), np.float64(1.0))

In [49]:
scaled_X_test.mean(), scaled_X_test.std()

(np.float64(0.011785767482586662), np.float64(1.0126754945869354))

## Predict house price

In [57]:
from sklearn.linear_model import LinearRegression, ElasticNetCV, RidgeCV

model = LinearRegression()

def predict_house_prices(model):
    model.fit(scaled_X_train, y_train)
    y_pred = model.predict(scaled_X_test)

    return y_pred

predict_house_prices(LinearRegression())

array([ 300737.96146322,  322526.54694731, 1065210.85443018, ...,
        643999.08015631,  469111.72478894,  840591.34119427],
      shape=(1518,))

In [54]:
y_test.values

array([ 544000.,       0., 1712500., ...,  450000.,  364000.,  403500.],
      shape=(1518,))

## Evaluate models

In [61]:
from sklearn.metrics import mean_absolute_error, mean_squared_error
import numpy as np


def compute_metrics(y_test, y_pred):
    mae = mean_absolute_error(y_test, y_pred)
    mse = mean_squared_error(y_test, y_pred)
    rmse = np.sqrt(mse)

    return {
        "mean_absolute_error": mae,
        "mean_squared_error": mse,
        "root_mean_squared_error": rmse,
    }


y_pred_linear_regression = predict_house_prices(LinearRegression())
y_pred_ridge = predict_house_prices(RidgeCV())
y_pred_elasticnet = predict_house_prices(ElasticNetCV())

compute_metrics(y_test, y_pred_linear_regression)

{'mean_absolute_error': 191619.89682973272,
 'mean_squared_error': 621146478359.3947,
 'root_mean_squared_error': np.float64(788128.4656446528)}

In [62]:
compute_metrics(y_test, y_pred_ridge)

{'mean_absolute_error': 191467.13343828384,
 'mean_squared_error': 621010766797.4192,
 'root_mean_squared_error': np.float64(788042.3635804227)}

In [63]:
compute_metrics(y_test, y_pred_elasticnet)

{'mean_absolute_error': 259614.7954667765,
 'mean_squared_error': 664292302019.2043,
 'root_mean_squared_error': np.float64(815041.2885364792)}